Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་ལྷའི་མིག་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔས་རབ་ཏུ་ཤེས་སོ།
en: There are bodhisattvas who know everything within the range of the divine clairvoyance of the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷའི་མིག་གང་ཡིན་པ་དེ་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་མི་ཤེས་སོ། །སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་།
en: However, Śāradvatīputra, the gods of the Caturmahā­rāja­kāyika realm do not reciprocally know the divine clairvoyance of those bodhisattva great beings, nor do the gods of Trayastriṃśa, Yāma, {Dt.78} Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha [reciprocally] know it. “

source: ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱིས་མི་ཤེས་ཏེ། ལྷའི་མིག་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་དང་སྐྱེ་བ་རབ་ཏུ་ཤེས་སོ།
en: With their divine clairvoyance, bodhisattva great beings can know the death and rebirth of beings in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā.

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་། བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་དང་སྐྱེ་བ་རབ་ཏུ་ཤེས་སོ།
en: They can know the death and rebirth of beings in the world systems in each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷའི་མིག་ཡོངས་སུ་དག་པའོ། །གསོལ་པ།
en: This, Śāradvatīputra, is the refined eye of divine clairvoyance possessed by bodhisattva great beings.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་མིག་ཡོངས་སུ་དག་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་མིག་གང་དང་ལྡན་པས། འདུས་བྱས་སམ། འདུས་མ་བྱས་སམ།
en: Blessed Lord,” he then asked, “what is the refined eye of wisdom possessed by bodhisattva great beings?” “

source: དགེ་བ་འམ་མི་དགེ་བ་འམ། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་འམ། ཁ་ན་མ་ཐོ་བ་མེད་པ་འམ། ཀུན་ནས་ཉོན་མོངས་པ་འམ། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་འམ། འཇིག་རྟེན་པའམ་འཇིག་རྟེན་ལས་འདས་པ་འམ། ཟག་པ་དང་བཅས་པ་འམ།
en: Śāradvatīputra,” replied the Blessed One, “with their eye of wisdom, bodhisattva great beings do not cognize anything at all that is conditioned or unconditioned, virtuous or nonvirtuous, tainted or untainted by transgressions, defiled or undefiled, mundane or supramundane, contaminated or uncontaminated.

source: ཟག་པ་མེད་པའི་ཆོས་གང་ཡང་མི་ཤེས་པ་མེད་པ་དང་། ཤེས་རབ་ཀྱི་མིག་གང་དང་ལྡན་པས། ཆོས་གང་ཡང་མ་མཐོང་བ་འམ། མ་ཐོས་པ་འམ། མ་བསམས་པ་འམ།
en: There is nothing at all that they see with their eye of wisdom, nothing that they hear, nothing that they think, and nothing that they comprehend.

source: ཁོང་དུ་མ་ཆུད་པ་མེད་པ་འདི་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་མིག་ཡོངས་སུ་དག་པའོ། །གསོལ་པ།
en: This, Śāradvatīputra, is the refined eye of wisdom possessed by bodhisattva great beings.” {

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཀྱི་མིག་ཡོངས་སུ་དག་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཀྱི་མིག་གིས།
en: Dt.79} “Blessed Lord,” he then asked, “what is the refined eye of the Dharma possessed by bodhisattva great beings?” “

source: གང་ཟག་འདི་ནི་དད་པའི་རྗེས་སུ་འགྲོ་བ། གང་ཟག་འདི་ནི་ཆོས་ཀྱི་རྗེས་སུ་འགྲོ་བ། གང་ཟག་འདི་ནི་སྟོང་པ་ཉིད་ལ་གནས་པ་སྟེ། གང་ཟག་འདིའི་དབང་པོ་ལྔ་ནི་རྣམ་པར་ཐར་བའི་སྒོ་སྟོང་པ་ཉིད་ཀྱིས་སྐྱེ་བར་འགྱུར་རོ། །དབང་པོ་ལྔས་དེ་མ་ཐག་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ།
en: Śāradvatīputra,” replied the Blessed One, “with their eye of the Dharma, bodhisattva great beings know: ‘This individual is a follower on account of faith, this one is a follower of the doctrine, this one dwells in emptiness, and this individual is developing the five faculties through the gateway to liberation of emptiness, and will acquire immediate meditative stability by means of these five faculties.

source: །དེ་མ་ཐག་པའི་ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་སྐྱེ་བར་འགྱུར་རོ། །རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བས། འཇིག་ཚོགས་ལ་ལྟ་བ་དང་། ཐེ་ཚོམ་དང་ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་སྙེམས་པའི་ཀུན་དུ་སྦྱོར་བ་གསུམ་རབ་ཏུ་སྤོང་བར་འགྱུར་ཏེ།
en: Through that immediate meditative stability, this individual will develop insight into the knowledge of liberation, and then, through that insight into the knowledge of liberation, will forsake the three fetters, which comprise false views about perishable composites, doubt, and a sense of moral and ascetic supremacy.

source: གང་ཟག་འདི་ནི་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བྱའོ། །དེས་བསྒོམ་པའི་ལམ་རབ་ཏུ་ཐོབ་ནས། འདོད་པའི་འདོད་ཆགས་དང་། གནོད་སེམས་རབ་ཏུ་སྲབས་པར་བྱེད་དེ། གང་ཟག་འདི་ནི་ལན་ཅིག་ཕྱིར་འོང་བའོ།
en: This individual will then be known as one who has entered the stream to nirvāṇa, and after attaining the path of meditation, will be destined for only one more rebirth, wearing down both attachment to the [realm of] desire and malice.

source: །དེ་ལམ་དེ་ཉིད་དེ་བས་ཀྱང་ཤིན་ཏུ་བསྒོམས་ནས། འདོད་པའི་འདོད་ཆགས་དང་། གནོད་སེམས་རབ་ཏུ་སྤོང་བ་ཐོབ་པར་བྱེད་དེ། གང་ཟག་འདི་ནི་ཕྱིར་མི་འོང་བའོ།
en: Then, through further cultivation of that same path of meditation, the same individual will abandon attachment to [the realm of] desire and malice in their entirety, and will no longer be subject to rebirth.

source: །དེ་ལམ་དེ་ཉིད་དེ་བས་ཀྱང་ཤིན་ཏུ་བསྒོམས་པས། གཟུགས་ཀྱི་འདོད་ཆགས་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་དང་། མ་རིག་པ་དང་། ང་རྒྱལ་དང་རྒོད་པ་རབ་ཏུ་སྤོང་སྟེ།
en: Then, through further cultivation on the path of meditation, this same individual will forsake [the five fetters associated with the higher realms, namely] attachment to the realm of form, attachment to the realm of formlessness, ignorance, pride, and mental agitation.

source: གང་ཟག་འདི་ནི་དགྲ་བཅོམ་པའོ།
en: Then, this individual will become an arhat.’ “ ‘

source: །གང་ཟག་འདི་ནི་མཚན་མ་མེད་པ་ལ་གནས་པ་སྟེ། གང་ཟག་འདིའི་དབང་པོ་ལྔ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པས་སྐྱེ་བར་འགྱུར་རོ། །དབང་པོ་ལྔས་དེ་མ་ཐག་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ། །དེ་མ་ཐག་པའི་ཏིང་ངེ་འཛིན་གྱིས།
en: This individual dwells in signlessness, is developing the five faculties through the gateway to liberation of signlessness, and will acquire the immediate meditative stability by means of these five faculties.

source: རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་སྐྱེ་བར་འགྱུར་བ་ནས།
en: Through that immediate meditative stability, this individual will develop insight into the knowledge of liberation, and then is said to acquire [the fruits], up to and including arhatship.’ “ ‘

source: གང་ཟག་འདི་ནི་དགྲ་བཅོམ་པའི་བར་ཞེས་བྱའོ། །གང་ཟག་འདི་ནི་སྨོན་པ་མེད་པ་ལ་གནས་པས། འདིའི་དབང་པོ་ལྔ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་སྨོན་པ་མེད་པས་སྐྱེ་བར་འགྱུར་རོ། །དབང་པོ་ལྔས་དེ་མ་ཐག་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ།
en: This individual dwells in wishlessness, is developing the five faculties through the gateway to liberation of wishlessness, and will acquire the immediate meditative stability by means of these five faculties.

source: །དེ་མ་ཐག་པའི་ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་སྐྱེ་བར་འགྱུར་བ་ནས། གང་ཟག་འདི་ནི་དགྲ་བཅོམ་པའོ་ཞེས་བྱ་བའི་བར་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Through that immediate meditative stability, this same individual will develop insight into the knowledge of liberation, and then is said to acquire [the fruits], up to and including arhatship.’

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཀྱི་མིག་ཡོངས་སུ་དག་པའོ།
en: This, Śāradvatīputra, is the refined eye of the Dharma possessed by bodhisattva great beings. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གང་ཅི་ཡང་རུང་སྟེ། ཀུན་འབྱུང་བའི་ཆོས་ཅན་དེ་ཐམས་ཅད་ནི་འགག་པའི་ཆོས་ཅན་ནོ་ཞེས་བྱ་བར་ཤེས་པས། དབང་པོ་ལྔ་ཐོབ་པར་འགྱུར་ཏེ།
en: Dt.80} “Moreover, Śāradvatīputra, bodhisattva great beings who know by all appropriate means that all phenomena associated with the cause of suffering are subject to cessation will acquire the five faculties.

source: འདི་ནི་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཀྱི་མིག་ཡོངས་སུ་དག་པའོ།
en: This, Śāradvatīputra, is the refined eye of the Dharma possessed by bodhisattva great beings. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཀྱི་མིག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་སེམས་དང་པོ་བསྐྱེད་པ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Moreover, Śāradvatīputra, with their eye of the Dharma, bodhisattva great beings will know: ‘These bodhisattva great beings are beginners, setting their mind on enlightenment, and practicing the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །དེའི་རྒྱུས་དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་ལྡན་ཏེ། ཐབས་མཁས་པས་ཆེད་དུ་བསམས་ཏེ་ལུས་ཡོངས་སུ་འཛིན་ཏོ།
en: For that reason, endowed with the faculties of faith and perseverance and motivated by skillful means, they will obtain [an excellent] corporeal form.

source: །དགེ་བའི་རྩ་བས་བརྟན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེའོ།
en: These bodhisattva great beings, steadfast on account of the roots of virtuous actions, will be reborn into great and lofty royal families.

source: །བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་། ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེའོ།
en: These will be reborn into great and lofty priestly families, or into great and lofty householder families.

source: །རྒྱལ་ཆེན་བཞིའི་རིགས་ཀྱི་ལྷའི་ནང་དུ་སྐྱེའོ།
en: These will be reborn among the gods of the Caturmahā­rāja­kāyika realm.

source: །སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ནང་དུ་སྐྱེའོ།
en: These will be reborn among the gods of Trayastriṃśa.

source: །མཚེ་མའི་ལྷའི་ནང་དུ་སྐྱེའོ།
en: These will be reborn among the gods of Yāma.

source: །དགའ་ལྡན་གྱི་ལྷའི་ནང་དུ་སྐྱེའོ།
en: These will be reborn among the gods of Tuṣita.

source: །འཕྲུལ་དགའི་ལྷའི་ནང་དུ་སྐྱེའོ།
en: These will be reborn among the gods of Nirmāṇarata.

source: །གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་ནང་དུ་སྐྱེའོ། །དེ་དག་ན་གནས་ཤིང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་ཏེ།
en: These will be reborn among the gods of Para­nirmita­vaśa­vartin.

source: བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་དེ་དག་ལ་རིམ་གྲོ་བྱེད་པར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཡང་བསྙེན་བཀུར་བྱེད་པར་འགྱུར་རོ། །རིམ་གྲོ་དང་བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱེད་པར་འགྱུར་རོ། །ཉན་ཐོས་ཀྱི་ས་འམ་རང་སངས་རྒྱས་ཀྱི་སར་ཡང་མི་ལྟུང་ངོ་།
en: Abiding in those [realms], they will bring beings to maturity, they will serve [beings] with all the resources that actualize their happiness, they will refine the buddhafields, and they will also venerate, serve, honor, respect, and worship the tathāgatas, arhats, and completely awakened buddhas, and never regress to the level of the śrāvakas or the level of the pratyekabuddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ཕྱིར་ལྡོག་པར་མི་འགྱུར་རོ། །ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་ཏེ།
en: Indeed, these bodhisattvas will not regress until they have attained consummate buddhahood in unsurpassed, complete enlightenment.’

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཀྱི་མིག་ཡོངས་སུ་དག་པའོ།
en: This, Śāradvatīputra, is the refined eye of the Dharma possessed by bodhisattva great beings. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པའོ། །འདི་ནི་ལུང་མ་བསྟན་པའོ།
en: Dt.81} “Moreover, Śāradvatīputra, these bodhisattva great beings know: ‘These bodhisattva great beings have been prophesied to attain unsurpassed, complete enlightenment, and those have not been prophesied.

source: །འདི་ནི་ངེས་པའོ། འདི་ནི་མ་ངེས་པའོ།
en: These are certain, and those are not certain.

source: །འདི་ནི་ལུང་བསྟན་པར་འགྱུར་བའོ། །འདི་ནི་ལུང་བསྟན་པར་མི་འགྱུར་བའོ།
en: These will be prophesied and those will not be prophesied.

source: །འདི་དག་ནི་ཕྱིར་མི་ལྡོག་པ་སྟེ་དབང་ཐོབ་པའོ། །འདི་དག་ནི་ཕྱིར་མི་ལྡོག་པ་མ་ཡིན་པ་སྟེ་དབང་མ་ཐོབ་པའོ།
en: These are irreversible and have attained the [five] faculties, but those are not irreversible and have not attained the [five] faculties.

source: །འདི་ནི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་རྫོགས་པའོ། །འདི་ནི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་མ་རྫོགས་པའོ།
en: These have perfected the extrasensory powers, while those have not perfected the extrasensory powers.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་རྫོགས་པས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་སོང་ཞིང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མཉེས་པར་བྱེད་དོ། །རིམ་གྲོ་དང་བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱེད་དོ།
en: These bodhisattva great beings, with perfected extrasensory powers, will proceed to the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and please, serve, honor, respect, and worship the tathāgatas, arhats, and completely awakened buddhas.

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་སོང་ཞིང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མཉེས་པར་བྱེད་དོ། །རིམ་གྲོ་དང་བཀུར་སྟི་དང་། བསྟི་སྟང་དང་མཆོད་པ་བྱེད་དེ།
en: These will proceed to the world systems in each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, and please, serve, honor, respect, and worship the tathāgatas, arhats, and completely awakened buddhas.

source: འདིས་ནི་མངོན་པར་ཤེས་པ་ཐོབ་པར་འགྱུར་རོ། །འདིས་ནི་མངོན་པར་ཤེས་པ་འཐོབ་པར་མི་འགྱུར་རོ།
en: These will attain the extrasensory powers, while those will not attain the extrasensory powers.

source: །འདི་ནི་བཟོད་པ་ཐོབ་པའོ། །འདི་ནི་བཟོད་པ་ཐོབ་པ་མ་ཡིན་ནོ།
en: These have attained receptiveness [to the truth that phenomena are nonarising], but those have not attained receptiveness.

source: །འདི་ནི་དབང་ཐོབ་པའོ། །འདི་ནི་དབང་ཐོབ་པ་མ་ཡིན་ནོ།
en: These have attained the [five] faculties, while those have not attained the [five] faculties.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདིའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །འདིའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་ཡོངས་སུ་དག་པར་མི་འགྱུར་རོ།
en: The buddhafield of these bodhisattva great beings will be utterly pure, but the buddhafield of those will not be utterly pure.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་སྨོན་ལམ་ཆེན་པོ་དང་ལྡན་པའོ། །འདི་ནི་སྨོན་ལམ་ཆེན་པོ་དང་མི་ལྡན་པའོ།
en: These bodhisattva great beings will have great aspirations, while those will not have great aspirations.

source: །འདིས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །འདིས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མ་བྱས་སོ།
en: These have brought beings to maturity, but those have not brought beings to maturity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ལ་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལེགས་པར་བརྗོད་པ་མཛད་དོ། །འདི་ལ་ནི་ལེགས་པར་བརྗོད་པ་མི་མཛད་དོ།
en: These bodhisattva great beings are praised by the lord buddhas, throughout the world systems of the ten directions, numerous as the grains of sand of the river Gaṅgā, but those are not praised.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ཉེ་བར་གནས་པར་འགྱུར་རོ། །འདི་དག་ནི་ཉེ་བར་གནས་པར་མི་འགྱུར་རོ།
en: These bodhisattva great beings will stand alongside the lord buddhas, while those will not stand alongside them.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་བྱང་ཆུབ་ཐོབ་ནས་ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ། །འདི་ནི་ཚེ་དཔག་ཏུ་ཡོད་པར་འགྱུར་རོ།
en: The lifespan of these bodhisattva great beings who have attained enlightenment will be infinite, but the lifespan of those will be finite.

source: །འདིའི་འོད་དང་དབྱངས་དང་དགེ་སློང་གི་དགེ་འདུན་ནི་ཚད་མེད་པར་འགྱུར་རོ། །འདི་ནི་ཚད་ཡོད་པར་འགྱུར་རོ།
en: The luminosity, voice, and saṅgha of these will be immeasurable, while [the luminosity and so forth] of those will be measurable.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་ལྡན་པར་འགྱུར་རོ། །འདི་ནི་ལྡན་པར་མི་འགྱུར་རོ།
en: These bodhisattva great beings, having attained consummate buddhahood in unsurpassed, complete enlightenment, will have a community of bodhisattvas, but those will not. {

source: །འདི་ནི་དཀའ་བ་སྤྱོད་པར་འགྱུར་རོ། །འདི་ནི་སྤྱོད་པར་མི་འགྱུར་རོ།
en: Dt.82} These will engage in austerities, but those will not.

source: །འདི་ནི་སྲིད་པ་ཐ་མ་པའོ། །འདི་ནི་སྲིད་པ་ཐ་མ་པ་མ་ཡིན་ནོ།
en: These are in their final rebirth, but those are not in their final rebirth.

source: །འདི་ནི་སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་པར་འགྱུར་རོ། །འདི་ནི་འདུག་པར་མི་འགྱུར་རོ།
en: These bodhisattvas will come to sit upon the seat of enlightenment, but those will not.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་ལ་ནི་བདུད་ཡོད་པར་འགྱུར་རོ། །འདི་དག་ལ་ནི་བདུད་ཡོད་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་ཏེ།
en: These bodhisattva great beings will face māras, while those will not face them.’

source: དེ་ལྟར་ན་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་ཀྱི་མིག་ཡོངས་སུ་དག་པ་ཡིན་ནོ།
en: This, Śāradvatīputra, is the refined eye of the Dharma possessed by bodhisattva great beings.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་མིག་ཡོངས་སུ་དག་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the refined eye of the buddhas possessed by bodhisattva great beings?” “

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་རྗེས་ལ། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དེ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ལྡན་པ་ཡིན། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: Śāradvatīputra,” replied the Blessed One, “bodhisattva great beings, after setting their mind on enlightenment, become absorbed in the vajra-like meditative stability, and then attain all-aspect omniscience.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་ཐར་བ་བསྒྲིབས་པ་མེད་པ་དང་ལྡན་པ་ཡིན།
en: They are endowed with the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, great compassion, great empathetic joy, great equanimity, and the unobscured liberation of the buddhas.

source: དེ་ནི་དེའི་མིག་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མིག་དེ་དང་ལྡན་པས། རྣམ་པ་ཐམས་ཅད་དུ་མ་མཐོང་བ་འམ། མ་ཐོས་པ་འམ། མ་ཤེས་པ་འམ།
en: Their vision is such that, in all respects, there is nothing at all that the eye of the buddhas, possessed by bodhisattva great beings, does not see, does not hear, does not know, or does not comprehend.

source: ཁོང་དུ་མ་ཆུད་པ་གང་ཡང་མེད་དེ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་མིག་ཡོངས་སུ་དག་པའོ།
en: This, Śāradvatīputra, is the refined eye of the buddhas, possessed by bodhisattva great beings who would attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མིག་ལྔ་ཡོངས་སུ་སྦྱང་བར་འདོད་པ་དང་། ཐོབ་པར་འདོད་པས། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་པར་བྱའོ།
en: Śāradvatīputra, bodhisattva great beings who wish to refine and who wish to acquire those five eyes should persevere in the six perfections.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཏུ་དགེ་བའི་ཆོས་ཐམས་ཅད་མ་འདུས་པ་མེད་དེ།
en: If you ask why, Śāradvatīputra, it is because there are no virtuous attributes that are not gathered in the six perfections.

source: ཉན་ཐོས་ཀྱི་ཆོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མ་འདུས་པ་མེད་དོ།
en: There are no attributes of the śrāvakas, {Dt.83} no attributes of the pratyekabuddhas, no attributes of the bodhisattvas, and no attributes of the buddhas that are not gathered there.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ལ་ལ་ཞིག་ཡང་དག་པར་སྨྲ་བས་དགེ་བའི་ཆོས་ཐམས་ཅད་འདུས་པར་བརྗོད་པ་ཞིག་དུ་དགོས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དག་པར་སྨྲ་བས་བརྗོད་དོ།
en: Śāradvatīputra, when those who speak correctly are required to speak of that in which all virtuous attributes are gathered, they speak of the perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་མིག་ལྔ་བསྐྱེད་པའོ།
en: If you ask why, Śāradvatīputra, the perfection of wisdom generates the five eyes.

source: །མིག་ལྔ་པོ་དེ་དག་ལ་བསླབས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: Bodhisattva great beings who train in those five eyes will attain manifest buddhahood in unsurpassed, complete enlightenment. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མངོན་པར་ཤེས་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རབ་ཏུ་འཐོབ་སྟེ།
en: Śāradvatīputra, bodhisattva great beings who practice this perfection of wisdom acquire perfection in the extrasensory powers.

source: རྫུ་འཕྲུལ་གྱི་རྣམ་པ་དུ་མ་ཉམས་སུ་མྱོང་བར་བྱེད་དོ།
en: That is to say, they experience many facets of miraculous ability.

source: །དེ་ནི་ས་ཆེན་པོ་འདི་ཡང་རབ་ཏུ་གཡོ་བར་བྱེད་དོ།
en: They may even cause this mighty earth to shake.

source: །གཅིག་ཏུ་གྱུར་ཅིང་མང་པོར་འགྱུར་རོ། །མང་པོར་གྱུར་ཅིང་གཅིག་ཏུ་འགྱུར་རོ།
en: Having been singular [in form], they can become multiple, and having been multiple [in form], they can become singular.

source: །སྣང་བ་དང་མི་སྣང་བ་ཡང་ཉམས་སུ་མྱོང་བར་བྱེད་དོ།
en: They may also experience themselves as visible and as invisible.

source: །རྩིག་པ་ལས་ཐལ་བ་དང་ར་བ་ལས་ཐལ་བ་དང་།
en: Their bodies can move directly through walls. They can move directly through enclosures.

source: རི་ལས་ཐལ་བར་ཐོགས་པ་མེད་པའི་ལུས་ཀྱིས་འགྲོ་སྟེ། དཔེར་ན་ནམ་མཁའ་ལ་བྱ་བ་བཞིན་ནོ།
en: They can move directly through mountains, unimpededly, as if in space.

source: །ནམ་མཁའ་ལ་ཡང་སྐྱིལ་མོ་ཀྲུང་གིས་འགྲོ་སྟེ། དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ།
en: They can also move through space, sitting with their legs crossed, like a bird on the wing.

source: །ས་ལ་ཡང་གྱེན་དུ་འབྱུང་བ་དང་། འོག་ཏུ་འཛུལ་བ་བྱེད་དེ། དཔེར་ན་ཆུ་ལ་བྱ་བ་བཞིན་ནོ།
en: They can hover above the earth and sink below it, as if in water.

source: །ཆུ་ལ་ཡང་འབྱིང་བ་མེད་པར་འགྲོ་སྟེ། དཔེར་ན་ས་ལ་བྱ་བ་བཞིན་ནོ།
en: They can walk on water, without sinking, as if on solid ground.
